my-app/server/artillery_tests/qna.yml
config:
  target: "http://localhost:3000"
  http:
    # Responses have to be sent within 10 seconds, or an `ETIMEDOUT` error gets raised.
    timeout: 10
  phases:
    - name: Testing Questions and Answers
      duration: 20
      arrivalRate: 20
      rampTo: 20
scenarios:
  - name: Get questions 
    flow:
      - get:
          url: "/qa/questions/?product_id={{ $randomNumber(1, 1000000) }}"
  - name: Get answers
    flow:
      - get:
          url: "/qa/questions/{{ $randomNumber(1, 3000000) }}/answers"