my-app/server/artillery_tests/reviews.yml
config:
  target: "http://localhost:3000"
  http:
    # Responses have to be sent within 10 seconds, or an `ETIMEDOUT` error gets raised.
    timeout: 10
  phases:
    - name: Testing Reviews
      duration: 20
      arrivalRate: 5
      rampTo: 5
scenarios:
  - name: Get reviews
    flow:
      - get:
          url: "/reviews"
  - name: Get meta
    flow:
      - get:
          url: "/reviews/meta"
  - name: Get reviews for a product
    flow:
      - get:
          url: "/reviews/1"